In [25]:
import numpy as np
import pandas as pd

In [26]:
# 값 조작
df = pd.DataFrame([[10, 20, 30, 100], [40, 50, 100, 80], [90, 100, 110, 120], [90, 110, 120, 140], [90, 100, 110, 120]],
                  columns = list('ABCD'),
                  index=pd.date_range(start='2024-01-01', periods=5))
df

             A    B    C    D
2024-01-01  10   20   30  100
2024-01-02  40   50  100   80
2024-01-03  90  100  110  120
2024-01-04  90  110  120  140
2024-01-05  90  100  110  120

In [27]:
df1 = df.copy()

df1['D'] = [1, 2, 3, 4, 5]
# df1.loc[:, 'D'] = [1, 2, 3, 4, 5]
df

             A    B    C    D
2024-01-01  10   20   30  100
2024-01-02  40   50  100   80
2024-01-03  90  100  110  120
2024-01-04  90  110  120  140
2024-01-05  90  100  110  120

In [28]:
df1.loc['2024-01-02'] = [1, 2, 3, 4]
df1

             A    B    C  D
2024-01-01  10   20   30  1
2024-01-02   1    2    3  4
2024-01-03  90  100  110  3
2024-01-04  90  110  120  4
2024-01-05  90  100  110  5

In [29]:
# A열의 값이 20보다 큰 행의 값을 1씩 증가하세요.
df1[df1['A'] > 20] = df1[df1['A'] > 20] + 1
df1

             A    B    C  D
2024-01-01  10   20   30  1
2024-01-02   1    2    3  4
2024-01-03  91  101  111  4
2024-01-04  91  111  121  5
2024-01-05  91  101  111  6

In [30]:
# A열의 값이 20보다 큰 행의 값을 1씩 증가하세요.

# df2 = df1['A'].apply(lambda n: n+1 if n > 20 else n)
# df2  # 팬시 인덱싱이 아니기때문에 series 반환

df1['A'] = df1['A'].apply(lambda n: n+1 if n > 20 else n)
df1

             A    B    C  D
2024-01-01  10   20   30  1
2024-01-02   1    2    3  4
2024-01-03  92  101  111  4
2024-01-04  92  111  121  5
2024-01-05  92  101  111  6

In [31]:
# C열의 값이 100보다 크고, D열의 값이 140보다 작은 값들을 1로 변경하세요.
df1.loc[(df1['C'] > 100) & (df1['D'] < 140)] = 1
df1

             A   B   C  D
2024-01-01  10  20  30  1
2024-01-02   1   2   3  4
2024-01-03   1   1   1  1
2024-01-04   1   1   1  1
2024-01-05   1   1   1  1

In [32]:
df2 = df1.apply(lambda n: n/10)
df2

              A    B    C    D
2024-01-01  1.0  2.0  3.0  0.1
2024-01-02  0.1  0.2  0.3  0.4
2024-01-03  0.1  0.1  0.1  0.1
2024-01-04  0.1  0.1  0.1  0.1
2024-01-05  0.1  0.1  0.1  0.1

In [34]:
def init(row):
    if row['A'] == np.nan:
        return 0
    else:
        return 1
    
df2 = df1.apply(init, axis=1) # 열방향 -> 열을 선택
df2

2024-01-01    1
2024-01-02    1
2024-01-03    1
2024-01-04    1
2024-01-05    1
Freq: D, dtype: int64

In [35]:
df2 = df1[df1 > 30]
df2

             A   B   C   D
2024-01-01 NaN NaN NaN NaN
2024-01-02 NaN NaN NaN NaN
2024-01-03 NaN NaN NaN NaN
2024-01-04 NaN NaN NaN NaN
2024-01-05 NaN NaN NaN NaN

In [38]:
# 타입변환
df = pd.DataFrame([[1, 2.5, 3, 4.7]], columns=list('ABCD'))
df

   A    B  C    D
0  1  2.5  3  4.7

In [39]:
df1 = df.astype('int')
df1

   A  B  C  D
0  1  2  3  4

In [40]:
df1 = df.astype({'A':'int64', 'B':np.int64})
df1

   A  B  C    D
0  1  2  3  4.7

In [41]:
df = pd.DataFrame([['1', '2.5', '3', '4.7']], columns=list('ABCD'))
df

   A    B  C    D
0  1  2.5  3  4.7

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       1 non-null      object
 1   B       1 non-null      object
 2   C       1 non-null      object
 3   D       1 non-null      object
dtypes: object(4)
memory usage: 160.0+ bytes

In [44]:
df1 = df1.astype('int')
df1

   A  B  C  D
0  1  2  3  4

In [45]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       1 non-null      int32
 1   B       1 non-null      int32
 2   C       1 non-null      int32
 3   D       1 non-null      int32
dtypes: int32(4)
memory usage: 144.0 bytes

In [54]:
df = pd.DataFrame({'A지점':['1,000', '2,000', '3,000'],
                   'B지점':['4,000', '5,000', '6,000'],
                   'C지점':['7,000', '8,000', '9,000']
                  },
                  index=pd.date_range(start='20240101', periods=3, freq='D'))
df

              A지점    B지점    C지점
2024-01-01  1,000  4,000  7,000
2024-01-02  2,000  5,000  8,000
2024-01-03  3,000  6,000  9,000

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 3 entries, 2024-01-01 to 2024-01-03
Freq: D
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A지점     3 non-null      object
 1   B지점     3 non-null      object
 2   C지점     3 non-null      object
dtypes: object(3)
memory usage: 96.0+ bytes

In [56]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()

In [57]:
def to_int(num):
    result = num.replace(',', '')
    return int(result)

apply <- map(Series) + applymap(Dataframe)
### 시리즈 -> 값 리턴, 데이터프레임 -> 시리즈 리턴

In [63]:
df1['A지점'] = df['A지점'].apply(to_int)  # 요소에 적용(시리즈 -> 값 리턴, 데이터프레임 -> 시리즈 리턴)
df1['B지점'] = df['B지점'].apply(to_int)
df1['C지점'] = df['C지점'].apply(lambda x: np.char.replace(x, ',', '')).astype('int')
df1

             A지점   B지점   C지점
2024-01-01  1000  4000  7000
2024-01-02  2000  5000  8000
2024-01-03  3000  6000  9000

In [69]:
df2['A지점'] = df['A지점'].map(to_int)  # map -> Series 적용
df2['B지점'] = df['B지점'].map(to_int)
df2

             A지점   B지점    C지점
2024-01-01  1000  4000  7,000
2024-01-02  2000  5000  8,000
2024-01-03  3000  6000  9,000

In [70]:
df['A지점']

2024-01-01    1,000
2024-01-02    2,000
2024-01-03    3,000
Freq: D, Name: A지점, dtype: object

In [71]:
df3 = df.applymap(to_int)  # Datafrmae에 적용
df3

C:\Users\My\AppData\Local\Temp\ipykernel_5528\625238627.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df3 = df.applymap(to_int)

             A지점   B지점   C지점
2024-01-01  1000  4000  7000
2024-01-02  2000  5000  8000
2024-01-03  3000  6000  9000

In [73]:
df4 = df[['A지점', 'B지점']].applymap(to_int)
df4

C:\Users\My\AppData\Local\Temp\ipykernel_5528\3073188667.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df4 = df[['A지점', 'B지점']].applymap(to_int)

             A지점   B지점
2024-01-01  1000  4000
2024-01-02  2000  5000
2024-01-03  3000  6000

In [77]:
def convert_int(s):
    result = s.map(lambda x: x.replace(',', ''))  # Series
    print(type(result))
    return result.astype('int')

In [78]:
df5 = df.apply(convert_int)
df5

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

             A지점   B지점   C지점
2024-01-01  1000  4000  7000
2024-01-02  2000  5000  8000
2024-01-03  3000  6000  9000